# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'cloudfoundry/tap'

# Upgrade ruby & bash
brew 'ruby'
brew 'bash'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'awscli'
cask 'ibm-cloud-cli'
brew 'cf-cli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'jq'
# brew 'reattach-to-user-namespace'
brew 'the_silver_searcher'
brew 'tmux'
brew 'unrar'
brew 'wget'
brew 'httpie'
brew 'youtube-dl'
brew 'direnv'
brew 'starship'

# development
brew 'nvm'
brew 'yarn'
brew 'nvim'
cask 'docker'
cask 'kitematic'
cask 'sourcetree'
cask 'visual-studio-code'
cask 'meld'
cask 'robo-3t'
brew 'go'

# Apps
cask 'firefox'
# cask 'google-chrome'
cask 'vivaldi'
cask 'iterm2'
# cask 'vlc'
# cask 'android-file-transfer'
cask 'keka'
# cask 'razer-synapse'
cask 'steam'
cask 'gog-galaxy'
cask 'tidal'
cask 'beoplay-software-update'
cask 'postman'
cask 'balenaetcher'
cask 'mysqlworkbench'
cask 'handbrake'
cask '1password'

# Production Audio
# brew 'qjackctl'
cask 'bitwig-studio'

# Research
#cask 'anaconda'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-anonymice-powerline'
cask 'font-awesome-terminal-fonts'
cask 'font-consolas-for-powerline'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-firacode-nerd-font'
cask 'font-firacode-nerd-font-mono'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-inconsolata-for-powerline'
cask 'font-iosevka'
cask 'font-iosevka-nerd-font'
cask 'font-iosevka-nerd-font-mono'
cask 'font-menlo-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'

# Install Mac App Store apps
# mas 'Paw', id: 584653203
